/*	Задание 01. Никита и бассейн (Nikita and Swimming Pool)
*
*	Никита плавал в бассейне размером N×M метров и устал. В этот момент он обнаружил,
*	что находится на расстоянии X метров от одного из длинных бортиков (не обязательно от ближайшего)
*	и Y метров от одного из коротких бортиков.
*	Какое минимальное расстояние должен проплыть Никита, чтобы выбраться из бассейна на бортик и не утонуть?
*
*	Формат входных данных [input]
*	Функция принимает четыре целых числа: N и M - соответствующие размеры бассейна, X и Y - расстояние до бортиков,
*	где X и(или) Y могут быть также нулями.
*
*	Формат выходных данных [output]
*	Функция должна вовратить число метров, которое нужно проплыть Никите до бортика, чтобы не утонуть.
*
*	[Sample function input 1] (пример передаваемых в функцию параметров): 23 52 8 43
*	[Sample function output 1] (пример возвращаемого функцией результата): 8
*
*	[Sample function input 2] (пример передаваемых в функцию параметров): 14 7 6 11
*	[Sample function output 2] (пример возвращаемого функцией результата): 1
*
*	[Sample function input 3] (пример передаваемых в функцию параметров): 23 52 0 43
*	[Sample function output 3] (пример возвращаемого функцией результата): 0
*/

#include "Tasks.h"

int task01(int n, int m, int x, int y) {
	int x1;
	int y1;
	if (n > m) {
		x1 = n - x;
		y1 = m - y;
	}
	else {
		x1 = m - x;
		y1 = n - y;
	}


	if (x1 < x && (x < y || x < y1) && (y < y1 || y1 < y)) {
		return x1;
	}
	else if (x < x1 && (x1 < y || x1 < y1) && (y1 < y || y < y1)) {
		return x;
	}
	else if (y < x && x < x1 && x1 < y1) {
		return y;
	}
	else if (y1 < x1 && x1 < x && x < y) {
		return y1;
	}


}